# ####################################################################

#  Created by Genus(TM) Synthesis Solution 25.10-p002_1 on Mon Feb 23 17:24:32 PST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1000ps

# Set the current design
current_design temporal_coalescing_unit

create_clock -name "clk" -period 2.5 -waveform {0.0 1.25} [get_ports clk_i]
set_clock_transition 0.05 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports incmd_valid]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_block_id[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_block_id[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_block_id[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_block_id[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_tid[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports incmd_write_enable]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_data[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_mask[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_mask[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_mask[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_write_mask[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_address[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_size[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_size[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_ld_dest_reg[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_ld_dest_reg[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_ld_dest_reg[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_ld_dest_reg[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_ld_dest_reg[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_ld_dest_reg[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {incmd_ld_dest_reg[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports outcmd_ready]
