# ####################################################################

#  Created by Genus(TM) Synthesis Solution 25.10-p002_1 on Thu Feb 26 16:46:51 PST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1000ps

# Set the current design
current_design dice_rf_ctrl

create_clock -name "clk" -period 20.0 -waveform {0.0 10.0} [get_ports clk_i]
set_clock_transition 0.4 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports reset_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rd_tid_valid_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_unroll_factor_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_unroll_factor_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rd_en_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_tid_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_bitmap_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_tid_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[127]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[126]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[125]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[124]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[123]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[122]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[121]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[120]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[119]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[118]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[117]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[116]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[115]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[114]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[113]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[112]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[111]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[110]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[109]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[108]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[107]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[106]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[105]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[104]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[103]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[102]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[101]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[100]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[99]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[98]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[97]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[96]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[95]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[94]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[93]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[92]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[91]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[90]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[89]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[88]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[87]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[86]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[85]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[84]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[83]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[82]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[81]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[80]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[79]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[78]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[77]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[76]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[75]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[74]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[73]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[72]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[71]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[70]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[69]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[68]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[67]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[66]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[65]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[64]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {cgra_data_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {wr_bitmap_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports cgra_valid_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][255]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][254]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][253]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][252]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][251]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][250]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][249]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][248]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][247]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][246]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][245]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][244]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][243]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][242]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][241]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][240]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][239]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][238]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][237]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][236]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][235]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][234]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][233]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][232]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][231]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][230]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][229]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][228]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][227]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][226]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][225]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][224]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][223]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][222]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][221]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][220]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][219]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][218]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][217]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][216]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][215]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][214]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][213]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][212]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][211]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][210]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][209]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][208]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][207]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][206]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][205]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][204]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][203]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][202]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][201]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][200]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][199]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][198]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][197]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][196]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][195]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][194]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][193]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][192]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][191]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][190]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][189]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][188]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][187]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][186]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][185]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][184]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][183]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][182]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][181]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][180]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][179]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][178]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][177]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][176]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][175]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][174]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][173]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][172]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][171]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][170]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][169]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][168]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][167]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][166]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][165]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][164]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][163]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][162]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][161]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][160]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][159]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][158]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][157]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][156]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][155]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][154]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][153]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][152]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][151]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][150]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][149]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][148]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][147]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][146]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][145]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][144]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][143]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][142]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][141]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][140]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][139]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][138]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][137]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][136]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][135]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][134]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][133]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][132]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][131]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][130]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][129]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][128]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][127]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][126]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][125]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][124]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][123]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][122]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][121]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][120]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][119]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][118]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][117]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][116]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][115]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][114]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][113]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][112]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][111]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][110]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][109]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][108]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][107]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][106]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][105]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][104]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][103]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][102]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][101]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][100]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][99]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][98]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][97]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][96]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][95]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][94]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][93]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][92]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][91]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][90]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][89]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][88]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][87]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][86]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][85]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][84]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][83]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][82]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][81]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][80]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][79]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][78]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][77]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][76]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][75]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][74]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][73]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][72]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][71]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][70]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][69]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][68]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][67]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][66]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][65]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][64]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][63]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[core_rsp_data][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][0][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][0][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][0][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][0][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][0][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][1][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][1][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][1][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][1][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][1][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][2][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][2][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][2][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][2][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][2][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][3][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][3][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][3][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][3][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][3][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][4][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][4][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][4][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][4][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][4][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][5][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][5][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][5][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][5][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][5][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][6][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][6][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][6][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][6][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][6][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][7][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][7][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][7][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][7][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_address_map][7][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_ld_dest_reg][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_ld_dest_reg][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_ld_dest_reg][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_tid_bitmap][7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_tid_bitmap][6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_tid_bitmap][5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_tid_bitmap][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_tid_bitmap][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_tid_bitmap][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_tid_bitmap][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_tid_bitmap][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_base_tid][4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_base_tid][3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_base_tid][2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_base_tid][1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ldst_wr_i[outcmd_base_tid][0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports ldst_valid_i]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {clear_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {clear_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {clear_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {clear_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {clear_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {clear_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {clear_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {clear_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_rd_enable_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_rd_enable_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_rd_enable_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_rd_enable_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_rd_enable_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_rd_enable_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_rd_enable_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_rd_enable_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_sel_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[63]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[62]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[61]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[60]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[59]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[58]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[57]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[56]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[55]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[54]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[53]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[52]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[51]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[50]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[49]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[48]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[47]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[46]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[45]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[44]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[43]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[42]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[41]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[40]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[39]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[38]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[37]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[36]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[35]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[34]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[33]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[32]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {const_reg_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_x_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_x_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_x_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_x_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_x_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_y_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_y_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_y_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_y_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_y_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_z_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_z_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_z_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_z_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tid_z_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_x_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_x_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_x_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_x_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_x_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_y_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_y_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_y_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_y_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_y_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_z_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_z_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_z_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_z_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ntid_z_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_x_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_y_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {ctaid_z_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_x_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_y_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {nctaid_z_i[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rd_tid_ready_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[127]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[126]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[125]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[124]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[123]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[122]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[121]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[120]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[119]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[118]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[117]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[116]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[115]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[114]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[113]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[112]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[111]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[110]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[109]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[108]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[107]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[106]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[105]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[104]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[103]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[102]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[101]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[100]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[99]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[98]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[97]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[96]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[95]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[94]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[93]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[92]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[91]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[90]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[89]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[88]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[87]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[86]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[85]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[84]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[83]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[82]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[81]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[80]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[79]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[78]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[77]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[76]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[75]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[74]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[73]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[72]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[71]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[70]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[69]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[68]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[67]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[66]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[65]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[64]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {rd_data_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports rf_rd_valid_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports ldst_ready_o]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[63]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[62]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[61]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[60]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[59]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[58]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[57]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[56]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[55]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[54]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[53]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[52]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[51]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[50]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[49]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[48]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[47]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[46]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[45]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[44]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[43]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[42]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[41]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[40]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[39]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[38]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[37]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {spec_reg_out_o[0]}]
set_clock_uncertainty -setup 0.4 [get_clocks clk]
set_clock_uncertainty -hold 0.4 [get_clocks clk]
